# Apply

In [1]:
import pandas as pd

In [2]:
date_list = [{'yyyy-mm-dd': '2000-06-27'},
         {'yyyy-mm-dd': '2002-09-24'},
         {'yyyy-mm-dd': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [3]:
def extract_year(column):
    return column.split("-")[0]

In [4]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year)

In [5]:
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [6]:
def get_age(year, current_year):
    return current_year - int(year)

In [7]:
df['age'] = df['year'].apply(get_age, current_year = 2018)

In [8]:
df

   yyyy-mm-dd  year  age
0  2000-06-27  2000   18
1  2002-09-24  2002   16
2  2005-12-20  2005   13

In [9]:
def get_introduce(age):
    return "I am " + str(age) + " years old"

In [10]:
df['introduce'] = df['age'].apply(get_introduce)

In [11]:
df

   yyyy-mm-dd  year  age          introduce
0  2000-06-27  2000   18  I am 18 years old
1  2002-09-24  2002   16  I am 16 years old
2  2005-12-20  2005   13  I am 13 years old

In [12]:
def get_introduce_2(row):
    return "I was born in " + str(row.year) + " my age is " + str(row.age)

In [13]:
df.introduce = df.apply(get_introduce_2, axis =1)

In [14]:
df

   yyyy-mm-dd  year  age                        introduce
0  2000-06-27  2000   18  I was born in 2000 my age is 18
1  2002-09-24  2002   16  I was born in 2002 my age is 16
2  2005-12-20  2005   13  I was born in 2005 my age is 13

# Map

In [15]:
job_list = [{'age': 20, 'job': 'student'},
         {'age': 30, 'job': 'developer'},
         {'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(job_list)
df

   age        job
0   20    student
1   30  developer
2   30    teacher

In [16]:
df.job = df.job.map({"student": 1, "developer": 2, "teacher":3})

In [17]:
df

   age  job
0   20    1
1   30    2
2   30    3

# applymap
모든 값에 적용하고 싶을 때 사용한다

In [18]:
x_y = [{'x': 5.5, 'y': -5.6},
         {'x': -5.2, 'y': 5.5},
         {'x': -1.6, 'y': -4.5}]
df = pd.DataFrame(x_y)
df

     x    y
0  5.5 -5.6
1 -5.2  5.5
2 -1.6 -4.5

In [19]:
import numpy as np

In [20]:
df = df.applymap(np.around)

In [21]:
df

     x    y
0  6.0 -6.0
1 -5.0  6.0
2 -2.0 -4.0